      *COPY DO ARQUIVO DE CLIENTES
       01  ARQ-CLIENTES.
           05  COD-CLIENTE       PIC  9(007)         VALUE ZEROS.
           05  CNPJ              PIC  9(014)         VALUE ZEROS.
           05  RAZAO-SOCIAL      PIC  X(040)         VALUE SPACES.
           05  LATITUDE-CLIENTE  PIC S9(003)V9(008)  VALUE ZEROS.
           05  LONGITUDE-CLIENTE PIC S9(003)V9(008)  VALUE ZEROS.
           05  COD-VENDA-CLIENTE PIC  9(003)         VALUE ZEROS.
           
      


      


