      *COPY DO ARQUIVO DE DISTRIBUIÇÃO
       01  ARQ-DISTRIB.
           05  COD-CLIENTE-DISTRIB   PIC  9(007)         VALUE ZEROS.
           05  RAZAO-SOCIAL-DISTRIB  PIC  X(040)         VALUE SPACES.
           05  COD-VENDEDOR-DISTRIB  PIC  9(003)         VALUE ZEROS.
           05  NOME-VEND-DISTRIB     PIC  X(040)         VALUE SPACES.
           05  DISTANCIA-DISTRIB     PIC  9(009)V9(002)  VALUE ZEROS.
      


