      *COPY DE COMUNICACAO PROGRAMA HBSIS006P
       01  LNKG006L.
           05  TIPO-ORD-LNKG006      PIC  X(001)         VALUE SPACES.
           05  TIPO-CLA-LNKG006      PIC  X(001)         VALUE SPACES.
           05  COD-VEND-LNKG006      PIC  9(003)         VALUE ZEROS.
           05  NOME-VEND-LNKG006     PIC  X(040)         VALUE SPACES.
           05  COD-RETORNO-LNKG006   PIC  9(001)         VALUE ZEROS. 
           05  MSG-RETORNO-LNKG006   PIC  X(050)         VALUE SPACES.


