      *COPY DE COMUNICACAO PROGRAMA HBSIS008P
       01  LNKG008L.
           05  COD-RETORNO-LNKG008   PIC  9(001)         VALUE ZEROS.
           05  MSG-RETORNO-LNKG008   PIC  X(050)         VALUE SPACES.


