      *COPY DO ARQUIVO DE VENDEDORES
       01  ARQ-VENDEDOR.
           05  COD-VENDEDOR      PIC  9(003)         VALUE ZEROS. 
           05  CPF               PIC  9(011)         VALUE ZEROS.
           05  NOME-VENDEDOR     PIC  X(040)         VALUE SPACES.
           05  LATITUDE-VEND     PIC S9(003)V9(008)  VALUE ZEROS.
           05  LONGITUDE-VEND    PIC S9(003)V9(008)  VALUE ZEROS.
      


